thiagopprado/stm32f1_app_blink_rtos/core/src/main.c
/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include "stm32f1xx.h"

#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "task.h"

#include "gpio.h"

#include "stm32f1xx_hal.h"

/* Private types -------------------------------------------------------------*/

/* Private defines -----------------------------------------------------------*/
#define seconds(val)        (val * configTICK_RATE_HZ)
#define milliseconds(val)   (val * configTICK_RATE_HZ / 1000)

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
static void clock_config(void);
static void task_blink(void *param);

/* Private function implementation--------------------------------------------*/
/**
 * @brief MCU clock configuration.
 */
static void clock_config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
    RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);
}

static void task_blink(void *param) {
    gpio_state_t state = GPIO_STATE_HIGH;
    TickType_t last_wake_time = 0;

    gpio_setup(GPIO_PORTC, 13, GPIO_MODE_OUTPUT_50, GPIO_CFG_OUT_PUSH_PULL);
    last_wake_time = xTaskGetTickCount();

    while (1) {
        xTaskDelayUntil(&last_wake_time, milliseconds(1000));

        gpio_write(GPIO_PORTC, 13, state);
        state = !state;
    }
}

/* Public functions ----------------------------------------------------------*/
int main(void) {
    HAL_Init();
    clock_config();

    xTaskCreate(task_blink, "Task blink", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL);
    vTaskStartScheduler();
}
